## Exploratory Data Analysis

In [12]:
%load_ext sql
from sqlalchemy import create_engine
%sql postgresql://postgres:mMPR85ZV6psocMUPR98DDKWz@localhost/undp-viz4socialfgood
engine = create_engine('postgresql://postgres:mMPR85ZV6psocMUPR98DDKWz@localhost/undp-viz4socialfgood')

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

#### Where are the solutions coming from? What is their distribution per country & per region?

In [16]:
%%sql

SELECT  country, 
        count(*), 
        round(count(*)::numeric/
                (SELECT count(*) FROM es_map),3) pct
FROM es_map
GROUP BY 1
ORDER BY 2 DESC
LIMIT 10;

 * postgresql://postgres:***@localhost/undp-viz4socialfgood
10 rows affected.

[('india', 51, Decimal('0.142')),
 ('panama', 28, Decimal('0.078')),
 ('argentina', 27, Decimal('0.075')),
 ('pacific-fiji', 22, Decimal('0.061')),
 ('ecuador', 20, Decimal('0.056')),
 ('uganda', 17, Decimal('0.047')),
 ('burkina faso', 14, Decimal('0.039')),
 ('guatemala', 14, Decimal('0.039')),
 ('ethiopia', 14, Decimal('0.039')),
 ('cameroon', 13, Decimal('0.036'))]

In [27]:
%%sql 

SELECT  regional_bureau, 
        count(*) number_of_solutions,
        round(count(*) :: numeric / 
            (SELECT count(*) FROM es_map),3) pct
FROM es_map e
LEFT JOIN rgb r
ON e.country=r.country
GROUP BY 1
ORDER BY 2 DESC;

 * postgresql://postgres:***@localhost/undp-viz4socialfgood
5 rows affected.

[('RBA', 119, Decimal('0.331')),
 ('RBLAC', 105, Decimal('0.292')),
 ('RBAP', 103, Decimal('0.287')),
 ('RBAS', 25, Decimal('0.070')),
 ('RBEC', 7, Decimal('0.019'))]

#### What type of energy source is more prevalent, what is less? Are there differences per region, and why?

In [28]:
%%sql


SELECT  energy_source, 
        count(*),
        count(*) :: numeric /
                (SELECT count(*) FROM es_map) pct
FROM es_map
GROUP BY 1
ORDER BY 2 desc;

 * postgresql://postgres:***@localhost/undp-viz4socialfgood
11 rows affected.

[('household application', 107, Decimal('0.29805013927576601671')),
 ('solar', 93, Decimal('0.25905292479108635097')),
 ('thermal', 71, Decimal('0.19777158774373259053')),
 ('renewable general', 50, Decimal('0.13927576601671309192')),
 ('hydro', 16, Decimal('0.04456824512534818942')),
 ('wind', 9, Decimal('0.02506963788300835655')),
 (None, 4, Decimal('0.01114206128133704735')),
 ('chemical', 3, Decimal('0.00835654596100278552')),
 ('mechanical', 3, Decimal('0.00835654596100278552')),
 ('non-renewable', 2, Decimal('0.00557103064066852368')),
 ('solar / thermal', 1, Decimal('0.00278551532033426184'))]

#### What type of energy source is more prevalent, what is less? Are there differences per region, and why?

In the Asia Pacific region, `household application` energy sources are prevalent. `solar` and `thermal` energies have also been prominent, although to a lesser extent. There is a similar pattern in the African region, where `household applications` are most prevalent, with `solar` and `thermal` energy being less prevalent. 

The situation is different in the Latin American region, where `solar` energy has a higher prevalence, with `household applications` ranking third.

In [29]:
%%sql 

SELECT energy_source, regional_bureau rgb, count(*) number_of_solutions
FROM es_map e
LEFT JOIN rgb r
ON e.country=r.country
GROUP BY 1,2
ORDER BY 3 DESC
LIMIT 10;

 * postgresql://postgres:***@localhost/undp-viz4socialfgood
10 rows affected.

[('household application', 'RBAP', 43),
 ('household application', 'RBA', 39),
 ('solar', 'RBLAC', 31),
 ('solar', 'RBAP', 29),
 ('thermal', 'RBA', 28),
 ('thermal', 'RBLAC', 25),
 ('solar', 'RBA', 22),
 ('renewable general', 'RBA', 20),
 ('household application', 'RBLAC', 19),
 ('renewable general', 'RBLAC', 17)]

#### What are global commonalities across solutions; what are typical applications & use cases for solutions? Are there patterns that emerge when looking at the distribution per country & per region?

Using the `string_to_array` and `unnest` functions, we evaluate the frequency of occurrence of words in the `title_translated` and `purpose_translated` columns. As a result, we will be able to explore the relationships between key fields within the database.

In [22]:
%%sql 

CREATE TEMPORARY TABLE IF NOT EXISTS word_count_title AS

(with cte AS (SELECT  regional_bureau rgb,
                      e.country, 
                      unnest(
                      string_to_array(
                            lower(
                                title_translated), ' ')) word 
              FROM es_map e
              JOIN rgb r
              ON e.country=r.country
             )

SELECT rgb, country, word, count(*) n
FROM cte
WHERE word NOT IN ('and','for','-','in','from','the','a','to','of','with','by','your','into', '&','that','be', 'is',
                   'it','on','has','as','this','an','can','he','at','are','which','we','so','out','they','or','will',
                   'also','these','its','only', 'not','was','his','their','i','bangladesh')
GROUP BY 1,2,3
HAVING count(*) >=3
ORDER BY 4 desc);

 * postgresql://postgres:***@localhost/undp-viz4socialfgood
Done.

[]

In [25]:
%%sql

WITH cte AS (
SELECT  rgb,
        country, 
        word, 
        ROW_NUMBER() OVER(PARTITION BY country ORDER BY n desc)
FROM word_count_title
GROUP BY 1,2,3,n)


SELECT  word, 
        count(*)
FROM cte
WHERE  rgb = 'RBLAC'
GROUP BY 1
ORDER BY 2 desc
LIMIT 10;

 * postgresql://postgres:***@localhost/undp-viz4socialfgood
10 rows affected.

[('solar', 3),
 ('energy', 2),
 ('electricity', 1),
 ('foundation', 1),
 ('hot', 1),
 ('isla', 1),
 ('island', 1),
 ('plant', 1),
 ('system', 1),
 ('thermoelectric', 1)]

In [17]:
%%sql

CREATE TEMPORARY TABLE IF NOT EXISTS word_count_purpose AS

(WITH cte AS (
    SELECT 
        country, 
        unnest(
		string_to_array(
			lower(
				purpose_translated), ' ')) word 
	FROM es_map)

SELECT   country, 
         word, 
         count(*) n
FROM cte
WHERE word NOT in ('and','for','-','in','from','the','a','to','of','with','by','your','into', '&',
                   'that','be', 'is','it','on','has','as','this','an','can','he','at','are','which','we',
                   'so','out','they','or','will','also','these','its','only', 'not','was','his','their','i')
GROUP BY 1,2
HAVING count(*) >=5
ORDER BY 1,3 desc);

 * postgresql://postgres:***@localhost/undp-viz4socialfgood
648 rows affected.

[]

In [18]:
%%sql

with cte AS (
			SELECT 
				country, 
				word, 
				ROW_NUMBER() OVER(PARTITION BY country ORDER BY n desc)
			FROM word_count_purpose
			GROUP BY 1,2,n)


SELECT word, count(*)
from cte
where row_number <=3 
group by 1
order by 2 desc
LIMIT 10;

 * postgresql://postgres:***@localhost/undp-viz4socialfgood
10 rows affected.

[('energy', 11),
 ('solar', 10),
 ('water', 7),
 ('power', 4),
 ('electricity', 3),
 ('system', 2),
 ('through', 2),
 ('', 2),
 ('solution', 2),
 ('cooking', 2)]

#### Which Sustainable Development Goals are the solutions advancing in particular, and how?

80% of the solutions relate to six of the 17 Sustainable Development Goals. Particular attention should be paid to 7, 11 and 9 which account for almost 60% of the total. Solutions associated with these SDGS are associated with clean energy, specifically solar and thermal energy. We also have solutions associated with clean cooking. When examining this solutions, prototypes that are open source stand out, while prototypes with intellectual property are less common.

In [30]:
%%sql


WITH cte AS (
SELECT  tag, 
        count(*),
        count(*)::numeric /(SELECT count(*) FROM sdg_tags) pct
FROM sdg_tags
GROUP BY 1
ORDER BY 2 DESC)

SELECT  tag,
        SUM(pct) OVER(ORDER BY pct DESC)
FROM cte
LIMIT 10;

 * postgresql://postgres:***@localhost/undp-viz4socialfgood
10 rows affected.

[(7, Decimal('0.33973589435774309724')),
 (11, Decimal('0.46578631452581032413')),
 (9, Decimal('0.57743097238895558223')),
 (13, Decimal('0.68187274909963985594')),
 (12, Decimal('0.76710684273709483793')),
 (3, Decimal('0.81032412965186074429')),
 (10, Decimal('0.85234093637454981992')),
 (2, Decimal('0.88355342136854741896')),
 (1, Decimal('0.91236494597839135654')),
 (8, Decimal('0.93877551020408163265'))]

In [35]:
%%sql

SELECT  new_tag thematic_tag, 
        energy_source,
        count(*)
        
FROM thematic_tags t
JOIN sdg_tags s
ON t.id=s.id
JOIN es_map e
ON t.id=e.id
WHERE tag in (7,11,9)
GROUP BY 1,2
ORDER BY 3 desc
LIMIT 10;

 * postgresql://postgres:***@localhost/undp-viz4socialfgood
10 rows affected.

[('clean energy', 'solar', 155),
 ('clean energy', 'household application', 122),
 ('clean cooking', 'household application', 85),
 ('solar energy', 'solar', 72),
 ('clean energy', 'thermal', 67),
 ('clean energy', 'renewable general', 66),
 ('environment friendly', 'household application', 32),
 ('energy saving', 'household application', 29),
 ('waste management', 'thermal', 23),
 ('affordable energy', 'household application', 23)]

In [40]:
%%sql

SELECT  
        prototype,
        product,
        diy_open_source,
        ip,
        count(*)
        
FROM es_map e
JOIN sdg_tags s
ON e.id=s.id
WHERE tag in (7,11,9)
GROUP BY 1,2,3,4
ORDER BY 5 desc
LIMIT 10;

 * postgresql://postgres:***@localhost/undp-viz4socialfgood
9 rows affected.

[('UNKNOWN', 'UNKNOWN', 'UNKNOWN', 'UNKNOWN', 209),
 ('TRUE', 'FALSE', 'TRUE', 'FALSE', 102),
 ('FALSE', 'TRUE', 'UNKNOWN', 'UNKNOWN', 58),
 ('FALSE', 'TRUE', 'TRUE', 'FALSE', 47),
 ('FALSE', 'TRUE', 'FALSE', 'TRUE', 29),
 ('TRUE', 'FALSE', 'UNKNOWN', 'UNKNOWN', 13),
 ('TRUE', 'FALSE', 'FALSE', 'TRUE', 12),
 ('UNKNOWN', 'UNKNOWN', 'TRUE', 'FALSE', 6),
 ('UNKNOWN', 'UNKNOWN', 'FALSE', 'TRUE', 5)]

#### Looking at the use case of clean cooking solutions, what is their prevalence, distribution, and source of energy?

Using the `clean cooking` tag as a reference, we found that it is associated with approximately 23% of all solutions. The majority of these solutions originate in India, with `household applications` being the primary source of energy.

In [45]:
%%sql

SELECT  count(*),
        round(count(*) :: numeric /
        (SELECT count(*) FROM es_map),3) pct
FROM es_map e
JOIN thematic_tags t
ON e.id=t.id
WHERE new_tag = 'clean cooking';

 * postgresql://postgres:***@localhost/undp-viz4socialfgood
1 rows affected.

[(82, Decimal('0.228'))]

In [46]:
%%sql

SELECT  country, 
        count(*),
        round(count(*) :: numeric /
        (SELECT count(*) FROM es_map),3) pct
FROM es_map e
JOIN thematic_tags t
ON e.id=t.id
WHERE new_tag = 'clean cooking'
GROUP BY 1
ORDER BY 2 DESC
LIMIT 10;

 * postgresql://postgres:***@localhost/undp-viz4socialfgood
10 rows affected.

[('india', 58, Decimal('0.162')),
 ('cameroon', 6, Decimal('0.017')),
 ('argentina', 3, Decimal('0.008')),
 ('ecuador', 2, Decimal('0.006')),
 ('syria', 2, Decimal('0.006')),
 ('rwanda', 2, Decimal('0.006')),
 ('ethiopia', 1, Decimal('0.003')),
 ('eswatini', 1, Decimal('0.003')),
 ('egypt', 1, Decimal('0.003')),
 ('pacific-fiji', 1, Decimal('0.003'))]

In [41]:
%%sql

SELECT energy_source, count(*)
FROM es_map e
JOIN thematic_tags t
ON e.id=t.id
WHERE new_tag = 'clean cooking'
GROUP BY 1
ORDER BY 2 DESC;

 * postgresql://postgres:***@localhost/undp-viz4socialfgood
4 rows affected.

[('household application', 73), ('thermal', 5), ('solar', 3), ('chemical', 1)]